export const validationStrings = {
    required: 'این فیلد اجباری است',
    mustBeNumber: 'این فیلد باید عددی باشد',
    invalidMobileNumber: 'شماره موبایل ورودی صحیح نیست',
    invalidEmail: 'ایمیل اشتباه است',
    passwordInvalidLength: 'گذروازه باید حداقل 5 کاراکتر داشته باشد',
    incorrectRepeatPassword: 'تکرار گذروازه اشتباه است',
    maxFileSizeExceeded: (size) => `حداکثر حجم فایل ${size} مگابایت می باشد`,
    maxFileCountExceeded: (count) => `حداکثر تعداد فایل ها ${count} می باشد`,
    atleastOneFileRequired: 'حداقل یک فایل مورد نیاز است'
};
const strings = {
    signInToSystem: 'ورود به سیستم',
    mobileNumber: 'شماره موبایل',
    aggreedWithRules:'با قوانین و مقررات موافقم',
    pleaseEnterVerifyCode:'لطفا کد تایید پیامک شده را وارد نمایید ',
    unknownError: 'خطایی رخ داده است، لطفا دوباره تلاش نمایید',
    loginHelp: 'لطفاً شماره تلفن همراه‌تان را وارد کنید تا کد فعال‌سازی برای شما ارسال شود.',
    show:'نمایش',
    ruleAgreementRequired:'موافقت با قوانین جهت عضویت اجباری می باشد',
    ruelsText:`لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.`,
    rules:'قوانین و مقررات'
};
export default strings;